
உள்ளீட்டுக்கோப்பு1 = '1மூலம்எண்ணி.txt'

with open(உள்ளீட்டுக்கோப்பு1) as f:
    print(sum(line.isspace() for line in f), '\n---------\n') 

# கையாளும் கோப்பினை, ஒவ்வொரு வரியாகப் படிக்கிறேன்.
with open(உள்ளீட்டுக்கோப்பு1,'r') as உகோப்பு1:
	உகோப்பு1தரவு = உகோப்பு1.readlines()
#	#print(type(உகோப்பு1தரவு))# பட்டியாக வரும். 
	#பட்டியாக இருப்பதால் ஒவ்வொன்றாக எடுக்கிறேன்.
	எண் = 0
	for வரி in உகோப்பு1தரவு :
		வரியளவு = len(வரி)
		
		if வரியளவு  < 3 :
			print(வரியளவு)
			எண் = எண் + 1
			#print(எண்)
			#print(வரி)
